[{"pk": 1, "model": "compsoc.page", "fields": {"content_markup": "html", "name": "home", "title": "Home", "nav_name": "Home", "is_in_navbar": true, "content": "<h2 class=\" \">Welcome to CompSoc's webspace!</h2>\r\n<p>This is the official website of The University of Edinburgh Artificial Intelligence and Computing Society, aka CompSoc. If you want to know more about who we are please take a look at the about page. The site is completely new, after having lost much of our old one we decided to make a new one!</p>\r\n<p>Anyway you're probably itching to grab the valuable information and latest updates on CompSoc's activities, so go ahead and explore!</p>\r\n<ul>\r\n<li>The <a href=\"/compsoc/page/about\">About</a> page will give you more information on who we are, what we do, and why you should join us!</li>\r\n<li><a href=\"/compsoc/page/faq\">FAQ</a> Page</li>\r\n<li>The <a href=\"/compsoc/page/news\">News page</a> provides the latest in CompSoc acitivites and upcoming events that we host, it is most up to date here!</li>\r\n<li>The <a href=\"http://plone.comp-soc.com/compsoc/knowledgebase\">KnowledgeBase</a> is CompSoc's information portal to all things computing in the University of Edinburgh and stock full with useful information.</li>\r\n<ul>\r\n<li>The KnowledgeBase expands as members contribute to it, much like wikipedia, but much more focused for Edinburgh University Purposes.</li>\r\n<li>It has been categorized to ease searching that is relevant to your needs, whether its suggestions and Information on Studying Informatics as a \"X\" year student, General Computing Knowledge, and Compsoc Related Information for SIGs and those seeking help from CompSoc.</li>\r\n<li>It includes super helpful information on getting used to DICE, Setting up a good Workbench (Linux, Windows, MacOs [dont ask Paul]), Book Reviews, TeamWork, Internships, and more! </li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li>A <a href=\"#TODO\">Users Page</a> where members can search for other members (Privacy can be set at will)</li>\r\n<li><a class=\"externa-link\" href=\"http://compsoc.hasacalendar.co.uk/event\">Calendar</a> with history of past events, hackathons, trips, etc. and the upcoming ones.</li>\r\n<li><a class=\"internal-link\" href=\"http://plone.comp-soc.com/compsoc/resolveuid/1032658bc935419799f358417db9a7e5\">IRC page</a> with a quick recommended tutorial on setting up your IRC client and getting connected to CompSoc's IRC.</li>\r\n<li><a class=\"internal-link\" href=\"/compsoc/page/sponsors\">Sponsors Page</a> with details to our Sponsors, and their contributions to our Society.</li>\r\n<li><a class=\"internal-link\" href=\"/compsoc/page/contact\">Contact Page</a> for More Detailed Contact Information.</li>\r\n<li><a class=\"internal-link\" href=\"/compsoc/page/hardlibrary\">HardLibrary</a> for info on CompSoc's Library (IN TESTING)</li>\r\n</ul>\r\n<p> </p>\r\n<p>If you have any questions, particularly if you are a student of the University of Edinburgh, or representative of a University of Edinburgh Society do not hesitate to contact us. We will try to answer your question or requests. CompSoc aims to get people interested in Computing and understanding the impact it has brought, so don't worry we will try not to bite =)</p>\r\n<p>I hope you will enjoy CompSoc and using this website to get your Computing fix!</p>\r\n<p> </p>\r\n<p>-Your CompSoc Committee</p>\r\n<p> </p>\r\n<p> </p>\r\n<p><strong>Contact Us Here: edinburghcompsoc@gmail.com</strong></p>\r\n<p><em><strong>P.S. If you have an old laptop, or piece of hardware that works, but you want to get rid of we'd gladly accept it. We always need test machines and supplies for CompSoc members for the maintenance of this site and those who need machines for extracurricular activities, but cannot afford one.</strong></em></p>"}}, {"pk": 2, "model": "compsoc.page", "fields": {"content_markup": "markdown", "name": "about", "title": "About", "nav_name": "About", "is_in_navbar": true, "content": "## Hello and Welcome to the Official University of Edinburgh CompSoc About Page! ##\r\nWe are The University of Edinburgh Computing Society and Artificial Intelligence Society, also more well known as CompSoc.\r\n\r\nCompsoc is a student run, gigantic cooking pot of geeky people who have a healthy (yet more likely unhealthy) interest in Computing and Information techonologies. This does not mean that the society in only interested in the technologies, theories and practice of Computing or how Cloud computing is just a marketing tool for a technology thats existed a lot longer. CompSoc is also concerned with the impact of computing and information technologies to the general public as a whole. \r\n\r\nThe society also encourages and provides support to those who want to collaborate with other peers and staff to realize their extracurricular projects and papers. These individuals and groups become SIGs (Special Interest Group). Even inside of The University of Edinburgh's informatics curriculum we try to provide support to students (especially those in first year) in line with their semester studies with special workshops provided by peers in CompSoc. For example: Last year we ran a midnight haskell session from 12-4 in the morning to get ready for an exam the next morning, and attendees felt that they did much better because of it. Moreover we have a Cascaders program in which you can approach any Cascaders Participant in Appleton Tower when you find them carrying a Plush Toy near their computer signifying their expertise (think Python for Python, Camel for Perl, Gandalf's hat for Lisp) as well as a SIG that is going to work on the webclient for Cascaders.\r\n\r\n+ The compsoc github page is [here](https://github.com/compsoc-edinburgh).\r\n+ Cascaders repo [here](https://github.com/compsoc-edinburgh/cascaders).\r\n+ Dont forget to check out the [KnowledgeBase](http://plone.comp-soc.com/compsoc/knowledgebase)!\r\n  \r\n\r\n\r\nWe also run a Student Tech Meet Up (STMU) monthly to invite industry experts, and starting this year, academia from the University Informatics Department to give talks on current issues and new tchnologies. There's also free pizza for everyone at this event. Always. Moreover committee members, SIGs, members of CompSoc are welcome to give talk in our STMU's as well. Many topics are allowed as topics of talks and can widely differ from the norm as well. For example, presentations on design patterns, XProgramming, and business psychology in the software market may be given by peers in CompSoc\r\n  \r\nIn the end we also love our traditional Hackathons to test our skill and valor in battle, for glory, street cred and loot.\r\n\r\nIt isn't all talks, keyboards and screens however. We run a pub social every other week, with the week in-between spent working on SIG projects and running events with our friends in GameDevSoc, Hoppers, and the Game Society. Not to forget: that we have other special events lined up that one shouldn't miss as these may form integral parts of your university memories.\r\n\r\n\r\n  \r\nSo in summary:\r\n\r\n1. Meeting place for like-minded individuals with vastly different skillsets and opinions to make friends with\r\n2. Support for to those who want to take part in extracurricular activities. (SIGs)\r\n3. Workshops and Informal Lectures for first years in need of extra help especially outside normal hours provided \r\n4. Cascaders\r\n5. Student Tech Meet Up to meet up with those in industry and from our University's brilliant department to learn some cool stuff or look for career opportunities\r\n6. Hackathons to test your mettle against your peers for glory (people have gotten jobs from this, and some even created their own start-ups!\r\n7. Pub Socials and SIGs on a weekly basis\r\n8. Special co-op events with our friends in GameDevSoc, Hoppers, and GameSoc\r\n9. Other awesome events planned along the year.\r\n10. Another 10th reason to get your fingers stretched out counting the reasons to join CompSoc\r\n  \r\n\r\n\r\nIf you think you need technical/programming/informatics/blah skills to enjoy CompSoc you are wrong! we are open to anyone and everyone in the University of Edinburgh so dont be afraid to pop in and say hi!\r\n\r\n\r\n \r\n-Your CompSoc Committee 2013-2014\r\n\r\n\r\n\r\n#### Contact Us! ####\r\n**Email:** edinburghcompsoc@gmail.com\r\n\r\n**IRC:** #compsoc @ irc.imaginarynet.org.uk\r\n\r\nYou can usually find Committee Members near AT4 or AT5 Westlab\r\n\r\n#### Committee (2013-2014) ####\r\n\r\n**President:** Paul M Scherer  (IRC: pmorio)\r\n\r\n**Secretary:** Kimberley McCann\r\n\r\n**Treasurer:** Martin Husbyn\r\n\r\n**Vice President:** Chris Swart\r\n\r\n**Technical Secretary:** Rikki \"Teh Numbers\" Guy (irc: R2ZER0, email: compsoc@rikkiguy.me.uk)\r\n\r\n**Social Secretary:** Craig Ross\r\n\r\n**4th Year Rep:**\r\n\r\n**3rd Year Rep:**\r\n\r\n**2nd Year Rep:** Lewis Barker\r\n\r\n**1st Year Rep:** Aseem Narang"}}, {"pk": 3, "model": "compsoc.page", "fields": {"content_markup": "html", "name": "faq", "title": "FAQ", "nav_name": "FAQ", "is_in_navbar": true, "content": "<h3 class=\" \">What is CompSoc?</h3>\r\n<p>We have a about page! You can find it on one of the tabs above.</p>\r\n<h3 class=\" \">What is the best programming language to learn first? What do you guys recommend?</h3>\r\n<p>This is not an easy question to answer because each language is suited for performing different tasks, and very often one language can perform the exact same thing as another (with about the same effort). However with the relatively recent and strong popularity of OOP based languages, it would be good to start on one of those just to get your feet wet. For this purpose Java and C# are good candidates because they are amongst the most popular languages for beginning programmers and have entire libraries of introductory books on them. The more daring would plunge off into C++ which maybe hard to use and timely to create programs in, but you will really begin to appreciate the level of control you get through it. Though you really should't worry about this at all, because The University of Edinburgh's excellent first year Informatics course holds your hand through Haskell and Java.</p>\r\n<p>Not an Informatics Student? No problem there's loads of ways to learn computing, hey you can start here!</p>\r\n<h3 class=\" \">What is the STMU?</h3>\r\n<p>The STMU is short for <b>S</b>tudent <b>T</b>ech <b>M</b>eet <b>U</b>p, a monthly meeting held by CompSoc in which we invite industry experts, our academic staff and members of CompSoc to hold talks on computing topics. Some of these may be showcasing a language that someone likes, introducing new theories/technologies/methods, or companies giving a taste of what their company is like and how they do things (after all students are an excellent source of interns/employees). The talks do not always have to computing related, occasionally we may have talks on issues computing technologies have in the world in a nontechnical-more-ethical manner, we may hold talks on teamwork methods for development teams, pass advice from successful start ups.</p>\r\n<h3 class=\" \">What is a SIG?</h3>\r\n<p>A SIG is a <b>S</b>pecial <b>I</b>nterest <b>G</b>roup. SIGs are groups of students/staff developers or researchers that are officially recognized by CompSoc and promoted by us. This means that we try to support them by booking rooms for them in Appleton Tower so that developers can meet in productive environments instead of their Garages once a week in Appleton Tower, bring the occasional pizza, and perform some of the more annoying administrative duties with them. By shoving several SIGs into a larger room we hope to have SIGs bounce ideas off of each other in hopes of gaining more success in their projects. We also attempt to support them through limited hardware access, volunteer personnel, or as a source of keen individuals who may want to be part of what the SIG is doing. In return SIGs will have to give reports on their progress (by allowing us to view their development site, or repository log) or via hand written paper. Additionally a SIG will have to present their project in a CompSoc event (STMU or Social), so that members aside from the committee may get an idea of what it is doing. Application for CompSoc SIG status is done via direct email with an abstract of the project goal, and readiness to present the idea in more detail in a committee meething. Don't worry we love all of you so were pretty lenient. We just dont accept projects that go against legal obligations.</p>\r\n<h3 class=\" \">What is Cascaders?</h3>\r\n<p>Cascaders is an informal peer assist programme that CompSoc runs. In essence what happens is that Cascaders participants can pick up an item that represents a topic that he/she wishes to help others on (ex. Snake plushie on top of a monitor indicate Python help being available) from a box located in the hallway to AT5 West lab. Once the items are placed, any person can come talk to them about help on that particular topic. This allows topics of both curriculum and extracurricular material to be discussed.</p>\r\n<h3 class=\" \">What are the Workshops that CompSoc host, what kind are there?</h3>\r\n<p>Workshops are much like our STMUs except they are more oriented at enforcing already present skills or introducing new ones in interactive fashion. To give an example there may be Haskell workshops near midterm exams to reinforce basic haskell syntax and conventions based on past experience in the course (such as list comprehensions and how they work/are written). There also may be workshops on team/project management methodologies and processes used by \"Agile\" software firms around the world.</p>\r\n<p><span>Workshops are organized by volunteer members in CompSoc, so please look out in the events/news page for announcements.</span></p>\r\n<h3 class=\" \">What are Hackathons?</h3>\r\n<p>Hackathons are often the most exciting times for CompSoc as this is the time when many of our members come together and compete to produce code in a set amount of time. Hackathon participants are usually given a theme to base their code around but are otherwise given complete freedom as to what they create (as long it's nothing malicious). Winners and honorable mentions are given prizes and the occasional job/internship offer from Sponsors of the event... so hackathons are our battles for glory and loot.</p>"}}, {"pk": 4, "model": "compsoc.page", "fields": {"content_markup": "markdown", "name": "contact", "title": "Contact Us", "nav_name": "Contact", "is_in_navbar": true, "content": "### Address: ###\r\n\r\nThe University of Edinburgh Computing and Artificial Intelligence Society (CompSoc)\r\n\r\nCompsoc, ITO, Appleton Tower 11 Crichton St, Edinburgh, City of Edinburgh, EH8 9LE\r\n\r\n### Phone ###\r\n\r\nTBA\r\n\r\n### Email: ###\r\n\r\n[edinburghcompsoc@gmail.com](mailto:edinburghcompsoc@gmail.com)"}}, {"pk": 5, "model": "compsoc.page", "fields": {"content_markup": "markdown", "name": "sponsors", "title": "Our Sponsors", "nav_name": "Sponsors", "is_in_navbar": true, "content": "## Many of our activities we do in CompSoc would not be possible without the contributions of our sponsors, so we have dedicated a page to them and their contributions.\r\n\r\n# Citigroup\r\n\r\n![Citigroup](http://plone.comp-soc.com/compsoc/sponsor-logos/citilogosmaller)\r\n\r\n**Description:** \r\n\r\nCitigroup contacted us first and gave us funds to be used in publications, hackathon prizes, SIGs, and for our STMUs\r\n\r\n# Accenture\r\n\r\n![Accenture](http://plone.comp-soc.com/compsoc/sponsor-logos/accenturelogorevised)\r\n\r\n**Description:** \r\n\r\nAccenture gave us funds for publications, hackathon prizes, STMU, SIGs, with some being dedicated to the purchase of a new Server, that provides hosting for this site as well as the hosting for many of our SIGs' project management pages.\r\n\r\n# DataSift\r\n\r\n![DataSift](http://plone.comp-soc.com/compsoc/sponsor-logos/datasiftlogo)\r\n\r\n**Description:**\r\n\r\nDataSift gave us funds for hacakthon prizes, general STMU fees,  and SIGs.\r\n\r\n# Amazon\r\n\r\n![Amazon](http://plone.comp-soc.com/compsoc/sponsor-logos/amazonlogo)\r\n\r\n**Description:**\r\n\r\nAmazon gave us funds for hackathon prizes, STMU, SIGs. In the past they have invited us to their Edinburgh Hackathon.\r\n\r\n# Google\r\n\r\n![Google](http://plone.comp-soc.com/compsoc/sponsor-logos/googlelogo)\r\n\r\n\r\n**Description:**\r\n\r\nGoogle gave us funds for hackathon prizes, general STMU fees, and SIGs."}}, {"pk": 6, "model": "compsoc.page", "fields": {"content_markup": "markdown", "name": "hardlibrary", "title": "Hard Library", "nav_name": "HardLibrary", "is_in_navbar": true, "content": "This program is in **testing** phase and reaction from members will be monitored.\r\n\r\n## Introduction\r\nCompSoc will now have a small library consisting of books on loan from members and generous people to be used in Appleton Tower. In addition to books we also keep a small collection of CDs with Open Source OS distributions. These articles are lent on a trust basis to be used either **inside** of Appleton Tower between CompSoc open hours and rented for longer time with through email so it would appreciated by **everyone** if no one takes them from their intended place of usage. The discs can be lent for 1 day to take home, or unlimited use in Appleton Tower. You should however still look at the real library as your main source of books.\r\n\r\nThe three main reasons this was initialised:\r\n\r\n1. Text books are expensive. The cost can be shared.\r\n2. The 3 hour time limit for high frequency books in the library hampers flexibility and makes it hard to take books to Appleton Tower.\r\n3. CDs used that were used to burn images of operating systems can be used by other people. \r\n\r\n\r\n## How To Use\r\n\r\n#### During Open Hours (10:00 - 18:00)\r\nThe plan is to have books put on display in the 5th floor WestLab inside a box where they are to be put back when done. This will only available when a CompSoc committee member is present to take the task for the day.\r\n\r\n#### Through Email\r\nEmail can be sent to edinburghcompsoc@gmail.com to request a book for a longer time or to take it home. The loan period will be decided with a present committee member, book form signed to ensure that the member renting the book will carry full responsibility for the lost book. Late turn ins will be penalised by scornful looks by the rest of the members :P \r\n\r\n## Currently Available Textbooks\r\nThe books are sorted by intended course year and miscellaneous books. Each book is listed by title with edition, author, year, and member who lent the book.\r\n\r\n### 1st Year\r\n\r\n- Essential Calculus Early Transcendentals by James Stewart (Paul Scherer)\r\n- Haskell The Craft of Functional Programming (3rd Ed.) by Thompson (Paul Scherer)\r\n\r\n### 2nd Year\r\n\r\n### 3rd Year\r\n\r\n### 4th Year\r\n\r\n### Misc\r\n\r\n- Accounting for Non-Accounting Students (3rd Ed.) by J.R Dyson (Paul Scherer)\r\n- Foundations of Marketing (3rd Ed.) by Jobber and Fahy (Paul Scherer)\r\n\r\n### Software\r\n\r\n- Debian Wheezy amd64 7.1.0 with xfce (Paul Scherer)\r\n- Debian Squeeze amd64 6.0.6 (Paul Scherer)\r\n- Xubuntu 12.04.1 amd64 (Paul Scherer)\r\n"}}, {"pk": 7, "model": "compsoc.page", "fields": {"content_markup": "markdown", "name": "joincompsoc", "title": "How to Join CompSoc", "nav_name": "Join CompSoc", "is_in_navbar": true, "content": "## Don't worry it's easy!\r\n\r\nA CompSoc membership costs £4 for the entire academic year. You will need a name (steal one if you dont have one!) a matric number (you cant steal this!) and an e-mail address (if you dont supply one, then we send it to your student mail account)\r\n\r\n## Online\r\nEUSA introduced a new way of signing up to societies ***through them*** as opposed to previous years where sign up was done with cash at any of our events.\r\n\r\nNow sign up is completed through EUSA's online payment scheme using MyEd. \r\nThis can be done [here](https://www.eusa.ed.ac.uk/societies/society/compsoc/) (redirects you to our society page on EUSA's webspace)\r\n\r\nTo join you will have to be logged into MyEd, as otherwise you wont be able to see the join button.\r\n\r\n## Offline\r\nAlternatively if you dont like joining through EUSA, you can still join CompSoc by going to the Teviot reception area, or Potterrow's EUSA office. \r\n\r\nIt is also possible to join us by talking to one of the committee members during an event, however it may take time for your membership to be processed by EUSA. \r\n\r\n## Done! No walls of text!"}}, {"pk": 8, "model": "compsoc.page", "fields": {"content_markup": "markdown", "name": "prehack", "title": "Pre-Hack", "nav_name": "Pre-Hack", "is_in_navbar": false, "content": "### The pre-hack is now over! It was a good run, and as this is the first year it happened, we would appreciate your feedback. Now we'll see you at the [Smart Data Hack](/ilwhack)! ###\r\n\r\n***Date:*** Jan 25-26 \r\n\r\n***Location:*** Appleton Tower 4th Floor\r\n\r\n***Starting Time:*** 10:00 A.M.\r\n\r\n***Host:*** The University of Edinburgh Artificial Intelligence and Computing Society (CompSoc) and The School of Informatics.\r\n\r\n## Schedule of Tutorial/Workshops ##\r\n\r\n### Saturday 25th of January ###\r\n\r\n- 1000 - 1040: Ewan Klein (Open Data Portals and Intro to SDH)\r\n- 1100 - 1200: Kit Barnes(Intro to Python and Data): [http://mess.ninjalith.com/prehack](http://mess.ninjalith.com/prehack)\r\n- 1200 - 1250: Break w/ mingling etc. (Coffee, Tea, Soda, Cookies)\r\n- 1300 - 1400: Paul Scherer (VCS/Team Workshop)\r\n- 1400 - 1500: Aaron Cronin (Using APIs)\r\n- 1800 - 1825: Those who hacked present ideas\r\n\r\n\r\n### Sunday 26th of January ###\r\n\r\n- 1000 - 1100: Rikki Guy (Intro to Django: Making web apps in Python)\r\n- 1100 - 1200: James Hulme (Android)\r\n- 1200 - 1250: Break (Coffee, Tea, Soda, Cookies)\r\n- 1600 - 1630: Those who hacked final presentations\r\n- 1700 - 1715: Announcement of winner --> Pub(?)\r\n\r\n### The Hack  ###\r\nAs well as the tutorials, there is a mini-hack going on.\r\n\r\nThe topic of this weekend's hack is: \"Using open data to improve student life\". Use day 1 to formulate your idea, and give a short (a couple of minutes) presentation on what your idea is - i.e. what data you would use, what you would do with the data, and how it could improve student life.\r\nOn day 2 you can implement your idea (or at least, start to), and at the end of the day give another mini-presentation showing what you've done. \r\n\r\nEwan Klein's open data page: [ http://ewan-klein.github.io/ilwhack/](http://ewan-klein.github.io/ilwhack/)\r\n\r\n## Purpose of Event ##\r\nThe purpose of the \"Pre-Hack\" is to allow participants who have never attended a hackathon and those who wish to learn or review how to make simple applications using data to attend tutorials and workshops in preparation for the upcoming Smart Data Hack in Innovative Learning Week. Attending the Pre-Hack will definitely give you a runnning start in the Hackathon!\r\n\r\nThe tutorials and workshops given will be themed around topics which should be relevant to skills and tasks encountered in the Smart Data Hack. Talks/Workshops include topics such as: an Introduction to Open Data Portals and data formats, Android development, using APIs, intro to Django, Data applications with Python, and more! (A full list with times can be found on the schedule below)\r\n\r\nEssentially we are trying to provide 4 talks/workshops a day that you can attend freely (though going to all of them is  ***highly recommended*** ). We think anymore would fry your brain too much for one day :)\r\n\r\nHowever those who have experience in making applications using datasets and wish to use this as an opportunity to make an application for a small prize (theres a bigger one later :D) may do so. In this case small teams (max. of 4) can make applications based on a theme/problem, revealed on the day. This will run as a thread seperate to the tutorials, as such you are still very welcome to attend the tutorials on the day.\r\n\r\nAs its name suggests the “Pre Hack” exists to prepare participants for the upcoming “Smart Data Hack” in the Innovative Learning Week. As such more focus will be placed in teaching participants about the data sets, tools, and practical skills that would be useful for this. As such if you would like to give a tutorial, or act as a mentor please contact edinburghcompsoc@gmail.com.\r\n"}}, {"pk": 1, "model": "ilwhack.page", "fields": {"content": "Smart Data Hack\r\n==============\r\n\r\n#### Registrations are [now open!](/ilwhack/register/)  ####\r\n\r\nWhat is it?\r\n------------\r\n\r\nThe Smart Data Hack &mdash; organised by the University of Edinburgh's the [School of Informatics](http://www.ed.ac.uk/schools-departments/informatics/) in collaboration with the [Business School](http://www.business-school.ed.ac.uk) and the [School of Design](http://www.eca.ed.ac.uk/school-of-design) &mdash; is a 5-day hackathon that brings students together with real-world problems in making sense of data. [Last year's Smart Data Hack](http://rhiaro.co.uk/ilwhack/) was a runaway success, and this year we are expanding the event by including more challenges and more partners!\r\n\r\nWhen and where?\r\n-----------------\r\n\r\nIt's happening from Mon 17th to Fri 21st February. For more details, see the [schedule](schedule). The hackathon itself will take place in Appleton Tower Level 4.\r\n\r\n* [Information for students](students)\r\n* [Information for sponsors](sponsors)\r\n* [Information for mentors](mentors)\r\n", "is_in_navbar": true, "name": "home", "nav_name": "Home"}}, {"pk": 3, "model": "ilwhack.page", "fields": {"content": "Info for Students\r\n==============\r\n\r\n#### [Registrations are now open!](/ilwhack/register/)  ####\r\n\r\nWhat is it?\r\n------------\r\nThe biggest event of the year &mdash; a 5-day Hackathon. Join a team to create cool applications around data, share ideas about design and explore business opportunities! \r\n\r\nWe'll provide a great venue for hacking, plenty of free food, workshops and mentors, and prizes at the end of it all. Use this as a chance to finally make a great idea you've had, to learn some new programming languages and skills, to have more great ideas, and if you like, to take up one of our challenges. \r\n\r\nCheck out [the great projects from last year](http://rhiaro.co.uk/ilwhack/finalprojects.php). And don't forget that there's useful information on [the pre-hack page](/compsoc/page/prehack).\r\n\r\nWho is it for?\r\n----------------\r\nThis event is open to all University of Edinburgh students who can join a team to do something innovative with data, creating a working prototype by the end of the week. Many Informatics students will be interested because it allows them to stretch their programming skills. But you **don't** have to be a programmer to get involved. Useful skills and areas of interest include:\r\n\r\n* Marketing\r\n* Visual design and user experience\r\n* Web development and programming\r\n* Data analysis and problem solving\r\n\r\nYou can register individually, and create or join teams *(of up to 5)* at any time. Don't worry if you don't have a team by the first day, we'll sort everybody out on the Monday afternoon! You can see a list of registered teams and individuals here.\r\n\r\nWhat do I need to know?\r\n------------------------------\r\nThere's no specific knowledge or experience required to take part in this event. Whether you're a designer, statistician or programmer, all you need is a willingness to get stuck in, work with other people and learn what you can.\r\n\r\nIn fact, if you've never made a web or native app before, this is a perfect opportunity to add some of these skills to your resumé.\r\n\r\nWhy?\r\n------\r\nYou'll come out of this event with new technical skills to show off, an appreciation of working with large datasets or unfamiliar APIs, and if everything goes to plan, a flashy app or website to add to your portfolio. You'll also likely have just spent a week working with up to four other people... evidence of 'teamwork' for your CV!\r\n\r\nIf you give it your all, there's a good chance you'll win one (or more!) of six awesome prizes. At the very least, you'll get free food every day.\r\n\r\nYou'll also get a warm, fuzzy feeling from creating something that could give real benefit local people or community groups.\r\n\r\nWhat should I make?\r\n-------------------------\r\nLook at the challenges, check out the data and think about what kinds or problems you want to address. Then think about the skills in your team, and look at what you can learn from the workshops and mentors to help you decide if you want to make a web app, a visualisation, or a native app for some device. Anything goes! Some of the challenges are pretty broad, and it should be easy to make something that fits under more than one...", "is_in_navbar": true, "name": "students", "nav_name": "Students"}}, {"pk": 5, "model": "ilwhack.page", "fields": {"content": "Schedule\r\n========\r\n\r\nThe Smart Data Hack will run from Monday 17th Feb to Friday 21st Feb. The rough schedule is shown below. Sponsors will have an opportunity to present their data and data challenges on the Monday morning. They are also warmly invited to the lunch on Monday, to the Show'n'Tell session on Wednesday, and to the prize-giving on Friday evening.\r\n\r\n<div class=\"table-responsive\">\r\n<table class=\"table\">\r\n<thead>\r\n<tr>\r\n<td>Time</td>\r\n<td>Monday</td>\r\n<td>Tuesday</td>\r\n<td>Wednesday</td>\r\n<td>Thursday</td>\r\n<td>Friday</td>\r\n</tr>\r\n</thead>\r\n<tbody>\r\n<tr>\r\n<td align=\"right\">9.00-11.00</td>\r\n<td>Presentations</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n</tr>\r\n<tr>\r\n<td align=\"right\">11.00-12.00</td>\r\n<td>Presentations</td>\r\n<td>Hack</td>\r\n<td>Show'n'Tell</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n</tr>\r\n<tr>\r\n<td align=\"right\">12.00-14.00</td>\r\n<td>Lunch</td>\r\n<td>Lunch</td>\r\n<td>Show'n'Tell/Lunch</td>\r\n<td>Lunch</td>\r\n<td>Lunch</td>\r\n</tr>\r\n<tr>\r\n<td align=\"right\">14.00-17.00</td>\r\n<td>Tutorials</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n<td>Judging</td>\r\n</tr>\r\n<tr>\r\n<td align=\"right\">17.00-18.00</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n<td>Hack</td>\r\n<td>Prize-giving</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n</div>", "is_in_navbar": true, "name": "schedule", "nav_name": "Schedule"}}, {"pk": 7, "model": "ilwhack.page", "fields": {"content": "Teach or Mentor\r\n-------------------\r\nStudents will have varying levels of technical knowledge and programming experience, so it's really important that there's plenty of opportunity for them to learn. We're looking for people with appropriate skills to mentor students or deliver short workshops over the course of the week. Useful topics include:\r\n\r\n *  Frontend web app stuff (HTML5, CSS3, JavaScript, mobile-first development)\r\n *  Web and app user interface design\r\n *  Native app programming (Android, iOS)\r\n *  Server-side stuff (PHP, Python, Ruby, and relevant frameworks)\r\n *  Data wrangling, visualisation and analysis\r\n *  Linked Data or Semantic Web technologies\r\n", "is_in_navbar": true, "name": "mentoring", "nav_name": "Mentoring"}}, {"pk": 11, "model": "ilwhack.page", "fields": {"content": "Info for Sponsors and Data Providers\r\n==============\r\n\r\nWhat is it?\r\n------------\r\nThe University of Edinburgh's [Innovative Learning Week](http://www.ed.ac.uk/staff-students/students/studies/innovative-learning) gives students a chance to take a break from the usual timetable and do something different to enrich their academic experience. In the [School of Informatics](http://www.ed.ac.uk/schools-departments/informatics/), we're introducing students to challenges faced by local organisations and community groups so that we can explore ways in which open data can be used to solve some of these problems. Students will be generating ideas and hacking with a range of technologies over the course of a week to generate prototype web and mobile applications which benefit the groups involved, or the public at large.\r\n\r\nWork With Us\r\n----------------\r\nThere are loads of ways of both supporting and benefiting from this event. Sponsors and partners are encouraged to give a short introduction to themselves (or their data or the challenges they're providing, as appropriate) during the opening of the event on the morning of Monday the 17th. \r\n\r\n\r\nShare Your Problems\r\n--------------------------\r\nWhatever the size or scope of your organisation, if you're based locally to Edinburgh and face challenges that might be solveable with technology, you can talk to us about getting involved. Maybe there's some software or an app you wish you had, data about the local area that would make a huge difference if you could access it, or a just vague feeling that a technical solution could benefit your organisation - we can work together to propose challenges for the students to work on.\r\n\r\n\r\nShare Your Data\r\n--------------------\r\nMaybe you've been collecting data about something (in any format), and want to see it used in new or interesting ways? Or you have an idea for an app that could use it or a visualisation of some kind. We'd love to offer it up to the students to experiment with, and we can help you convert it into alternative formats if need be.\r\n", "is_in_navbar": true, "name": "sponsors", "nav_name": "Sponsors"}}, {"pk": 1, "model": "ilwhack.participant", "fields": {"bio": "Hello! I'm a second year Informatics student.", "display_name": "Rikki Guy", "is_leader": false, "matric_no": "1215551", "user": 15, "team": null}}, {"pk": 5, "model": "ilwhack.participant", "fields": {"bio": "Mature 1st year product student. Interested in all types of product & industrial & app design. Interested in data collection, manipulation, presentation and algorithmic design. ", "display_name": "gmasterton", "is_leader": false, "matric_no": "s1346556", "user": 19, "team": null}}, {"pk": 7, "model": "ilwhack.participant", "fields": {"bio": "A former Photographer, Graphic Designer and Magazine Art Director. I am currently attending a MSc in Design and Digital Media.", "display_name": "Masa Mlakar", "is_leader": false, "matric_no": "s1364701", "user": 21, "team": null}}, {"pk": 9, "model": "ilwhack.participant", "fields": {"bio": "I am currently studying Design and Digital Media for my postgraduate degree. I previously worked as a graphic designer in New York City and received a bachelor's degree in Creative Advertising.", "display_name": "Erik Menches", "is_leader": false, "matric_no": "s1370474", "user": 23, "team": null}}, {"pk": 11, "model": "ilwhack.participant", "fields": {"bio": "hi(: 1st year comp sci.", "display_name": "Orisa", "is_leader": false, "matric_no": "s1309783", "user": 25, "team": null}}, {"pk": 13, "model": "ilwhack.participant", "fields": {"bio": "...  I am the night. 2nd year Comp Sci, I mostly know C, Python and Java, also know some Objective-C. Looking for a team, a friend and maybe more.", "display_name": "STM (Donal O'Shea)", "is_leader": false, "matric_no": "s1245356", "user": 27, "team": null}}, {"pk": 15, "model": "ilwhack.participant", "fields": {"bio": "", "display_name": "Henri Maurer", "is_leader": false, "matric_no": "s1345815", "user": 29, "team": null}}, {"pk": 17, "model": "ilwhack.participant", "fields": {"bio": "PHP is your friend, and I actually like Haskell", "display_name": "Uakari", "is_leader": false, "matric_no": "s1311631", "user": 31, "team": null}}, {"pk": 19, "model": "ilwhack.participant", "fields": {"bio": "Born in Portugal, with a background in Graphic Design.\r\nCurrently leaving and studying in Edinburgh, doing a MSc in Design and Digital Media at the University of Edinburgh.\r\nPassionate about most of the design fields, particularly Graphic, Web and UX/UI.\r\nAside from the skills related to graphic design I've aquired new skills throughout this year namely coding(HTML/CSS; AS 3.0; JavaScript; PHP).", "display_name": "AfonsoArez", "is_leader": false, "matric_no": "s1368129", "user": 33, "team": null}}, {"pk": 21, "model": "ilwhack.participant", "fields": {"bio": "", "display_name": "CraigSnowden", "is_leader": false, "matric_no": "1217709", "user": 35, "team": null}}, {"pk": 23, "model": "ilwhack.participant", "fields": {"bio": "2nd year in Informatics. Know Haskell, C#, Java, some C and Python and the tiniest bit of JavaScript (from last year's ILWhack). Currently experimenting with Android stuff, would like to learn more of that. And also web technologies to some extent, as long as it's not PHP or more JS.", "display_name": "Matthew Summers", "is_leader": false, "matric_no": "s1232732", "user": 37, "team": null}}, {"pk": 25, "model": "ilwhack.participant", "fields": {"bio": "Im a first year student, looking to get as much experience as possible in this sort of things. I have some very basic knowledge of python, htmll/css, java and haskell. im currently working on android, following a MOOC. mostly interested in game apps.", "display_name": "constantinos", "is_leader": false, "matric_no": "s1306275", "user": 39, "team": null}}, {"pk": 27, "model": "ilwhack.participant", "fields": {"bio": "", "display_name": "Borkl", "is_leader": false, "matric_no": "1236818", "user": 41, "team": null}}, {"pk": 29, "model": "ilwhack.participant", "fields": {"bio": "TODO: insert bio", "display_name": "aoeu", "is_leader": false, "matric_no": "s1249759", "user": 43, "team": null}}, {"pk": 31, "model": "ilwhack.participant", "fields": {"bio": "3rd year, will be around ILW attending presentations and tutorials.", "display_name": "Bagel", "is_leader": false, "matric_no": "s1136463", "user": 46, "team": null}}]